/*************************************************************************
*        PKG 생성  
*************************************************************************/
CREATE OR REPLACE PACKAGE kk_collection_pkg AS
    g_in_sawonid    VARCHAR2(4) := 's003';  -- 손예진 (임의 입력 사원 지정)
    g_prod_cnt      NUMBER(9)   := 0;
--------------------------------------------------------------------------------
------ 행동강령 : << 월 수불마감 PGM >>
------          1. 당월기초 입고 수량을 생성한다.(MMSUM30 기말재고를 익월 기초재고로 이월)
------          2. 일자별 거래처 제품별 판매현환(SMCP10)정보를 생성 PGM
------          3. 일자별 제품별 판매현황(SMProd10)정보를 생성 PGM
------              각각의 경우에 대해, 대분류별회계계정코드를 Update[2017.08.16]
--------------------------------------------------------------------------------
    PROCEDURE kk_collection_main (
        p_sum_yymm  IN  VARCHAR2,
        p_regi_emp_no   IN  VARCHAR2
        );
        
--------------------------------------------------------------------------------
------ 행동강령 : 1. 당월기초 입고 수량을 생성한다.(MMSUM30 기말재고를 익월 기초재고로 이월)
--------------------------------------------------------------------------------        
    PROCEDURE kk_collection_prc1 (
        p_sum_yymm  IN  VARCHAR2
        );
--------------------------------------------------------------------------------
------      2. 일자별 거래처 제품별 판매현환(SMCP10)정보를 생성 PGM
--------------------------------------------------------------------------------                
--    PROCEDURE kk_collection_prc2 (
--        p_sum_yymm  IN  VARCHAR2
--        );
--------------------------------------------------------------------------------
------      3. 일자별 제품별 판매현황(SMProd10)정보를 생성 PGM
--------------------------------------------------------------------------------            
--    PROCEDURE kk_collection_prc3 (
--        p_sum_yymm  IN  VARCHAR2
--        );
--------------------------------------------------------------------------------
------      9. 전체수불마감후 MMSUMM30을 SMSALE에 따라 STCK_QTY 차감 및 마감 처리작업
--------------------------------------------------------------------------------            
--    PROCEDURE kk_collection_end (
--        p_sum_yymm  IN  VARCHAR2
--        );


END kk_collection_pkg;
/
